Revit 2027 API
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Import Property
 Import external data into Revit model.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalDataManagerCommandId Import { get; }
Public Shared ReadOnly Property Import As ExternalDataManagerCommandId
	Get
public:
static property ExternalDataManagerCommandId^ Import {
	ExternalDataManagerCommandId^ get ();
}
static member Import : ExternalDataManagerCommandId with get
Property Value
ExternalDataManagerCommandId
See Also
Reference
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands Class
Autodesk.Revit.UI Namespace